app/Controllers/Home.php

SELECT *
FROM `komentar`
WHERE `restoran_id` = '3'
ORDER BY `id` DESC
---
    public function detail($id)
    {
        $restoModel = new \App\Models\RestoranModel();
        $komenModel = new \App\Models\KomentarModel();

        $data['restoran'] = $restoModel->getDetailWithRating($id);

        $data['komentar'] = $komenModel
            ->where('restoran_id', $id)
            ->orderBy('id', 'DESC')
            ->findAll();