app/Controllers/Restoran.php

SELECT *
FROM `restoran`
---
    public function index()
    {
        $data['restoran'] = $this->model->findAll();

SELECT *
FROM `restoran`
WHERE `restoran`.`id` = '2'
---
    public function edit($id)
    {
        $data['restoran'] = $this->model->find($id);