app/Models/RestoranModel.php

SELECT `restoran`.*, COUNT(komentar.id) as total_review, AVG(komentar.rating) as rata_rating
FROM `restoran`
LEFT JOIN `komentar` ON `komentar`.`restoran_id` = `restoran`.`id`
GROUP BY `restoran`.`id`
ORDER BY `rata_rating` DESC
---
    public function getWithRating()
    {
        return $this->select('restoran.*,
            COUNT(komentar.id) as total_review,
            AVG(komentar.rating) as rata_rating')
            ->join('komentar', 'komentar.restoran_id = restoran.id', 'left')
            ->groupBy('restoran.id')
            ->orderBy('rata_rating', 'DESC') // 🔥 INI PENTING
            ->findAll();

SELECT `restoran`.*, COUNT(komentar.id) as total_review, AVG(komentar.rating) as rata_rating
FROM `restoran`
LEFT JOIN `komentar` ON `komentar`.`restoran_id` = `restoran`.`id`
WHERE `restoran`.`id` = '3'
GROUP BY `restoran`.`id`
ORDER BY `restoran`.`id` ASC
 LIMIT 1
---
    public function getDetailWithRating($id)
    {
        return $this->select('restoran.*,
            COUNT(komentar.id) as total_review,
            AVG(komentar.rating) as rata_rating')
            ->join('komentar', 'komentar.restoran_id = restoran.id', 'left')
            ->where('restoran.id', $id)
            ->groupBy('restoran.id')
            ->first();